app/views/stories/show.html.erb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---

      <p>Type of Food: <span class="storyFoodCategory"><%= @story.food.category.name if @story.food.category.name.present? %></span></p>

SELECT "comments".* FROM "comments" WHERE "comments"."story_id" = ? ORDER BY created_at DESC  [["story_id", 2]]
---
    <div id="submitted-comments">
      <% @story.comment.each do |comment| %>