app/controllers/categories_controller.rb

  def create

    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "vvvvvvv"], ["created_at", "2021-12-07 15:14:32.207374"], ["updated_at", "2021-12-07 15:14:32.207374"]]