app/controllers/stories_controller.rb

  def index
    @foods = Food.all
    @stories = Story.all
---
SELECT "stories".* FROM "stories"

  def show
    @story = Story.find(params[:id])

      @user = User.find(@story.user_id)
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @story ||= Story.new
    # @story.build_food
    @foods = Food.all.map { |c| [ c.name, c.id ] }
    @categories = Category.all
---
SELECT "foods".* FROM "foods"
SELECT "categories".* FROM "categories"

  def create
    @story = Story.new(story_params)

    @story.user = current_user

    @food_check = Food.find_by(name: params[:story][:food][:name])

    # Huy san
    if @food_check
      @story.food = @food_check
    else
      @food = Food.new
      @food.name = params[:story][:food][:name]
      @food.category_id = params[:category]
      @food.save
---
SELECT "foods".* FROM "foods" WHERE "foods"."name" = ? LIMIT ?  [["name", "fff"], ["LIMIT", 1]]
INSERT INTO "foods" ("name", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?)  [["name", "sssssss"], ["created_at", "2021-12-10 12:53:03.431660"], ["updated_at", "2021-12-10 12:53:03.431660"], ["category_id", 1]]
INSERT INTO "stories" ("title", "content", "location", "user_id", "recommendation", "created_at", "updated_at", "food_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @story = Story.find(params[:id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @story = Story.find(params[:id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def destroy


    @story = Story.find(params[:id])
    if @story.user_id != current_user.id
      redirect_to root_path



    # if !current_user
    #   redirect_to new_user_session_path, alert: "You must be the author in order to delete a story."
    # elsif current_user != @story.user
    #   redirect_to :back, alert: "You must be the author in order to delete a story."
    else
      @story.destroy
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 7]]