app/views/categories/show.html.erb

        <ul>
          <% Food.where(category_id: @category.id).each do |food| %>
---
SELECT "foods".* FROM "foods" WHERE "foods"."category_id" = ?  [["category_id", 1]]